
string s = "abc.def.ghi"; // оголошуємо рядок та шукану букву
char letter = 'e'; // буква, яку будемо шукати
int pointIndex = s.IndexOf("."); // знаходимо позицію першої точки в рядку
int count = 0; // оголошуємо змінну для підрахунку кількості входжень букви

// цикл для перевірки кожного символу до першої точки
for (int i = 0; i < pointIndex; i++)
{
    // перевіряємо, чи символ співпадає з шуканою буквою
    if (s[i] == letter)
    {
        count++; // збільшуємо лічильник, якщо знайшли збіг
    }
}

Console.WriteLine(count); // виводимо результат на екран, результатом буде 0, оскільки в частині abc немає букви е
Console.ReadKey(); 