
string s = "abc.def.ghi"; // оголошуємо рядок для перевірки
char letter = 'e'; // буква, яку будемо шукати в рядку
int pointIndex = s.IndexOf("."); // за допомогою цього метода знаходимо позицію першої точки в рядку
int count = 0; // оголошуємо змінну для підрахунку кількості входжень букви

// цикл для перевірки кожного символу до першої точки
for (int i = 0; i < pointIndex; i++)
{
    // якщо індекс я рядку дорівнює е, тоді далі працює лічильник
    if (s[i] == letter)
    {
        count++; // збільшуємо лічильник, якщо знайшли збіг
    }
}

Console.WriteLine(count); // виводимо результат на екран, результатом буде 0, оскільки в частині abc немає букви е
Console.ReadKey(); 